---
type: DirectShapeReferenceOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 9
tags: [revit-api, class]
---

# DirectShapeReferenceOptions

`Autodesk.Revit.DB.DirectShapeReferenceOptions` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | DirectShapeReferenceOptions | — | `` |
| Constructor | DirectShapeReferenceOptions | 2022 | `public DirectShapeReferenceOptions ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetExternalGeometryId | 2024 | `public ExternalGeometryId GetExternalGeometryId ()` |
| Method | IsValidExternalGeometryId | 2024 | `public static bool IsValidExternalGeometryId ( ExternalGeometryId externalId )` |
| Method | IsValidReferenceName | 2022 | `public static bool IsValidReferenceName ( string name )` |
| Method | SetExternalGeometryId | 2024 | `public DirectShapeReferenceOptions SetExternalGeometryId ( ExternalGeometryId externalId )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Name | 2022 | `public string Name { get ; set ; }` |